; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v3 - type_2 ?v7 - type_1)
 	      (pred_2 ?v6 - object ?v7 - type_1)
	      (pred_4 ?v3 - type_2 ?v5 - type_3)
	      (pred_1 ?v3 - type_2 ?v6 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v3 - type_2 ?v8 ?v2 - type_1)
       :precondition (and  (pred_3 ?v3 ?v8))
       :effect (and  (pred_3 ?v3 ?v2)
		     (not (pred_3 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_2 ?v1 - object ?v4 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v4) (pred_3 ?v3 ?v4) (pred_4 ?v3 ?v5))
       :effect (and (pred_1 ?v3 ?v1 ?v5)
		    (not (pred_2 ?v1 ?v4)) 
		    (not (pred_4 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_2 ?v1 - object ?v4 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v1 ?v5) (pred_3 ?v3 ?v4))
       :effect (and (pred_2 ?v1 ?v4)
		    (pred_4 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v1 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_07 obj_12 - type_1
obj_06 obj_08 obj_11 obj_01 - type_3
obj_04 obj_02 obj_05 - type_2
obj_03 obj_09 obj_10 - object)
(:init
(pred_3 obj_07 obj_04)
(pred_4 obj_07 obj_06)
(pred_4 obj_07 obj_08)
(pred_3 obj_12 obj_05)
(pred_4 obj_12 obj_11)
(pred_4 obj_12 obj_01)
(pred_2 obj_03 obj_02)
(pred_2 obj_09 obj_04)
(pred_2 obj_10 obj_02)
)
(:goal
(and
(pred_2 obj_03 obj_05)
(pred_2 obj_09 obj_04)
(pred_2 obj_10 obj_02)
)
)

(:constraints
  (always (not (pred_3 obj_07 obj_05)))
)
)

; plan
1. (op_2 obj_07 obj_04 obj_02)
   deleted: (pred_3 obj_07 obj_04)
   added: (pred_3 obj_07 obj_02)
   goals met: 2 of 3
2. (op_2 obj_12 obj_05 obj_02)
   deleted: (pred_3 obj_12 obj_05)
   added: (pred_3 obj_12 obj_02)
   goals met: 2 of 3
3. (op_1 obj_12 obj_03 obj_02 obj_01)
   deleted: (pred_2 obj_03 obj_02) (pred_4 obj_12 obj_01)
   added: (pred_1 obj_12 obj_03 obj_01)
   goals met: 2 of 3
4. (op_2 obj_12 obj_02 obj_05)
   deleted: (pred_3 obj_12 obj_02)
   added: (pred_3 obj_12 obj_05)
   goals met: 2 of 3
5. (op_3 obj_12 obj_03 obj_05 obj_01)
   deleted: (pred_1 obj_12 obj_03 obj_01)
   added: (pred_2 obj_03 obj_05) (pred_4 obj_12 obj_01)
   goals met: 3 of 3
